#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.commons.module.function_consumptions_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.commons.module.function_apis_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.commons.module.function_consumptions_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]
module.commons.module.function_apis_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.commons.azurerm_cosmosdb_sql_container.trial will be created
  + resource "azurerm_cosmosdb_sql_container" "trial" {
      + account_name          = "ts-p-itn-cosno-01"
      + database_name         = "db"
      + default_ttl           = (known after apply)
      + id                    = (known after apply)
      + name                  = "trial"
      + partition_key_path    = "/ownerId"
      + partition_key_version = 2
      + resource_group_name   = "ts-p-itn-data-rg-01"
      + throughput            = (known after apply)

      + autoscale_settings {
          + max_throughput = 10000
        }

      + indexing_policy {
          + indexing_mode = "consistent"

          + composite_index {
              + index {
                  + order = "Ascending"
                  + path  = "/id"
                }
              + index {
                  + order = "Ascending"
                  + path  = "/ownerId"
                }
            }

          + included_path {
              + path = "/*"
            }
        }
    }

  # module.commons.azurerm_dashboard.main will be updated in-place
  ~ resource "azurerm_dashboard" "main" {
      ~ dashboard_properties = jsonencode(
          ~ {
              + apiVersion = "2015-08-01-preview"
              + location   = "INSERT LOCATION"
              + name       = "Main"
              + tags       = {
                  + hidden-title = "Main"
                }
              + type       = "Microsoft.Portal/dashboards"
                # (2 unchanged attributes hidden)
            }
        )
        id                   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-dashboards-rg-01/providers/Microsoft.Portal/dashboards/Main"
        name                 = "Main"
        tags                 = {}
        # (2 unchanged attributes hidden)
    }

  # module.commons.module.func_consumers.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          ~ "ACTIVATION_CONSUMER"                                            = "off" -> "on"
          ~ "EVENTS_PRODUCER"                                                = "off" -> "on"
          ~ "SUBSCRIPTION_HISTORY_CONSUMER"                                  = "off" -> "on"
          ~ "SUBSCRIPTION_REQUEST_CONSUMER"                                  = "off" -> "on"
          ~ "TRIAL_CONSUMER"                                                 = "off" -> "on"
            # (33 unchanged elements hidden)
        }
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-consumers-rg-01/providers/Microsoft.Web/sites/ts-p-itn-consumers-func-01"
        name                                           = "ts-p-itn-consumers-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Platform"
            "Owner"                                          = "TRIAL"
            "Source"                                         = "https://github.com/pagopa/trial-system"
        }
        # (26 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min       = 0 -> 2
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.commons.module.func_consumers.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          ~ "ACTIVATION_CONSUMER"                                            = "on" -> "off"
          ~ "EVENTS_PRODUCER"                                                = "on" -> "off"
          ~ "SUBSCRIPTION_HISTORY_CONSUMER"                                  = "on" -> "off"
          ~ "SUBSCRIPTION_REQUEST_CONSUMER"                                  = "on" -> "off"
          ~ "TRIAL_CONSUMER"                                                 = "on" -> "off"
            # (34 unchanged elements hidden)
        }
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-consumers-rg-01/providers/Microsoft.Web/sites/ts-p-itn-consumers-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Platform"
            "Owner"                                          = "TRIAL"
            "Source"                                         = "https://github.com/pagopa/trial-system"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

Warning: Deprecated Resource

  with module.commons.azurerm_dashboard.main,
  on ../modules/commons/dashboard.tf line 7, in resource "azurerm_dashboard" "main":
   7: resource "azurerm_dashboard" "main" {

The `azurerm_dashboard` resource is deprecated and will be removed in v4.0 of
the AzureRM Provider - the replacement is available as
`azurerm_portal_dashboard`.

(and one more similar warning elsewhere)

Warning: Argument is deprecated

  with module.commons.module.apim.azurerm_monitor_diagnostic_setting.apim,
  on .terraform/modules/commons.apim/api_management/main.tf line 355, in resource "azurerm_monitor_diagnostic_setting" "apim":
 355: resource "azurerm_monitor_diagnostic_setting" "apim" {

`retention_policy` has been deprecated in favor of
`azurerm_storage_management_policy` resource - to learn more
https://aka.ms/diagnostic_settings_log_retention

(and 14 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/commons.cosmosdb_account/cosmosdb_account/output.tf line 54, in output "connection_strings":
  54:   value     = azurerm_cosmosdb_account.this.connection_strings

The attribute "connection_strings" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
